In [1]:
import pandas as pd
import numpy as np

In [5]:
data=pd.read_csv("Desktop\Customer2.csv")

In [6]:
data

     Customer_id  age  income  spending score(1,100)
0              1   33   43908                      4
1              2   46   40923                     21
2              3   59   56036                      7
3              4   53   20313                     72
4              5   34   23188                     83
..           ...  ...     ...                    ...
195          196   54   45630                     31
196          197   58   48880                     10
197          198   35   29355                     43
198          199   26   52374                     16
199          200   37   39075                     55

[200 rows x 4 columns]

In [7]:
data.mean()

Customer_id                100.500
age                         40.905
income                   39970.640
spending score(1,100)       46.830
dtype: float64

In [9]:
data.loc[:,'age'].mean()

40.905

In [10]:
data.mean(axis=1)[0:4]

0    10986.50
1    10248.00
2    14026.25
3     5110.50
dtype: float64

In [11]:
data.median()

Customer_id                100.5
age                         41.0
income                   40108.0
spending score(1,100)       45.0
dtype: float64

In [12]:
data.mode()

     Customer_id   age  income  spending score(1,100)
0              1  24.0   20063                   34.0
1              2  53.0   20076                    NaN
2              3   NaN   20152                    NaN
3              4   NaN   20313                    NaN
4              5   NaN   20775                    NaN
..           ...   ...     ...                    ...
195          196   NaN   59017                    NaN
196          197   NaN   59389                    NaN
197          198   NaN   59564                    NaN
198          199   NaN   59825                    NaN
199          200   NaN   59855                    NaN

[200 rows x 4 columns]

In [13]:
data.loc[:,'age'].mode()

0    24
1    53
Name: age, dtype: int64

In [14]:
data.loc[:,'age'].min(skipna = False)

20

In [15]:
data.max()

Customer_id                200
age                         60
income                   59855
spending score(1,100)      100
dtype: int64

In [16]:
data.loc[:,'age'].max(skipna = False)

60

In [17]:
data.std()

Customer_id                 57.879185
age                         11.684976
income                   11981.023086
spending score(1,100)       29.381413
dtype: float64

In [18]:
data.loc[:,'age'].std()

11.684976180622215

In [19]:
data.std(axis=1)[0:4]

0    21947.671410
1    20450.007938
2    28006.511616
3    10135.040487
dtype: float64

In [24]:
df=pd.read_csv("Desktop\CustomerDet.csv")

In [25]:
df

     Customer_id  Gender  Age  Income  Spending Score(1-100)
0              1    Male   28   40474                      4
1              2    Male   21   44861                     12
2              3    Male   38   18258                     59
3              4  Female   29   21608                     35
4              5    Male   20   33027                     64
..           ...     ...  ...     ...                    ...
195          196    Male   21   42439                     40
196          197  Female   31   48704                     25
197          198    Male   24   48464                     12
198          199  Female   33   38451                     46
199          200  Female   22   26748                     71

[200 rows x 5 columns]

In [22]:
df.groupby(['Gender'])['Age'].mean()

Gender
Female    29.882353
Male      29.581633
Name: Age, dtype: float64

In [27]:
df_u = df.rename(columns={'Income': 'Annual_Income'}, inplace=False)
df_u.groupby(['Gender']).Annual_Income.mean()

Gender
Female    29258.336735
Male      29045.970588
Name: Annual_Income, dtype: float64

In [30]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_df = pd.DataFrame(enc.fit_transform(df[['Gender']]).toarray())
enc_df

       0    1
0    0.0  1.0
1    0.0  1.0
2    0.0  1.0
3    1.0  0.0
4    0.0  1.0
..   ...  ...
195  0.0  1.0
196  1.0  0.0
197  0.0  1.0
198  1.0  0.0
199  1.0  0.0

[200 rows x 2 columns]

In [31]:
df_encode =df_u.join(enc_df)
df_encode

     Customer_id  Gender  Age  Annual_Income  Spending Score(1-100)    0    1
0              1    Male   28          40474                      4  0.0  1.0
1              2    Male   21          44861                     12  0.0  1.0
2              3    Male   38          18258                     59  0.0  1.0
3              4  Female   29          21608                     35  1.0  0.0
4              5    Male   20          33027                     64  0.0  1.0
..           ...     ...  ...            ...                    ...  ...  ...
195          196    Male   21          42439                     40  0.0  1.0
196          197  Female   31          48704                     25  1.0  0.0
197          198    Male   24          48464                     12  0.0  1.0
198          199  Female   33          38451                     46  1.0  0.0
199          200  Female   22          26748                     71  1.0  0.0

[200 rows x 7 columns]